from fastapi import APIRouter
from services import CServiceTextUtils

from pydantic import BaseModel

router = APIRouter()


# *******************************************************************************************************
# Контроллер содержит обработку запросов на текстовые операции.                                         *
# @author Селетков И.П. 2019 1118.                                                                      *
# *******************************************************************************************************
class CData(BaseModel):
    text: str


# *******************************************************************************************************
# Выполнение лемматизации.                                                                              *
# *******************************************************************************************************
@router.post("/lemmatization")
async def lemmatization(data: CData):
    return await CServiceTextUtils.lemmatization(data.text)


# *******************************************************************************************************
# Выполнение стемминга.                                                                                 *
# *******************************************************************************************************
@router.post("/stemming")
async def stemming(data: CData):
    return await CServiceTextUtils.stemming_porter(data.text)
